<div id="main">

<h2>Que &eacute; Apertium e quem o est&aacute; a desenvolver?</h2>

<p>Apertium &eacute; um dos dois motores de tradu&ccedil;&atilde;o autom&aacute;tica
livre/de c&oacute;digo fonte aberto que come&ccedil;ou a ser desenvolvido dentro do projecto OpenTrad (2004-2005); Apertium est&aacute; desenhado para traduzir entre l&iacute;nguas relacionadas (veja-se Documenta&ccedil;&atilde;o mais abaixo).  O cons&oacute;rcio Opentrad foi liderado por Eleka Ingeniaritza Linguistikoa.</p>

<p>O projecto Opentrad ("Tradu&ccedil;&atilde;o autom&aacute;tica de c&oacute;digo aberto para as l&iacute;nguas do estado espanhol") foi financiado pelo Minist&eacute;rio de Ind&uacute;stria, Turismo e Com&eacute;rcio de Espanha atrav&eacute;s das ajudas PROFIT com c&oacute;digos FIT340101-2004-0003 e FIT340001-2005-0002.</p>

<p>Mais recentemente, Apertium recebeu tamb&eacute;m financiamento da Generalitat de Catalunya para desenvolver novos pares de l&iacute;nguas e um motor melhorado (Apertium 2.0) para incluir pares mais dif&iacute;ceis como o par ingl&ecirc;s-catal&atilde;o.</p>

<h2>quem o est&aacute; a desenvolver?</h2>

<p>A arquitectura Apertium est&aacute; a desenvolv&ecirc;-la o grupo de investiga&ccedil;&atilde;o <a href="http://transducens.dlsi.ua.es">Transducens</a> do <a href="http://www.dlsi.ua.es">Departamento de Linguagens e Sistemas Inform&aacute;ticos</a> da <a href="http://www.ua.es">Universidade de Alicante</a> em colabora&ccedil;&atilde;o com <a href="http://www.prompsit.com">Prompsit Language Engineering</a>.</p>

<p>Muitos grupos est&atilde;o a desenvolver dados lingu&iacute;sticos para Apertium.</p>

<p>Transducens e Prompsit est&atilde;o desenvolvendo os pares</p>

<ul>
	<li>espanhol-catal&atilde;o</li>
	<li>espanhol-portugu&ecirc;s</li>
	<li>catal&atilde;o-franc&ecirc;s</li>
	<li>occitano-catal&atilde;o e</li>
	<li>ingl&ecirc;s-catal&atilde;o)</li>
</ul>

<p>o <a href="http://webs.uvigo.es/sli/">Semin&aacute;rio de Lingu&iacute;stica Inform&agrave;tica</a> da <a href="http://www.uvigo.es/indice/index.gl.htm">Universidade de Vigo</a> desenvolve o par</p>
<ul>
	<li>espanhol-galego</li>
</ul>
<p>e o <a href="http://www.iula.upf.edu/">Institut Universitari de Lingu&iacute;stica Aplicada</a> da <a href="http://www.upf.edu/">Universitat Pompeu Fabra</a>, os pares</p>
<ul>
	<li>occitano-catal&atilde;o e</li>
	<li>ingl&ecirc;s-catal&atilde;o.</li>
	<li>French–Catalan</li>
</ul>

<h2>Financiamento</h2>

<p>Apertium &eacute; um dos dois motores de tradu&ccedil;&atilde;o autom&aacute;tica de c&oacute;digo aberto que come&ccedil;aram a ser desenvolvidos dentro do projecto <a href="http://www.opentrad.org/">OpenTrad</a> (2004–2005); Apertium est&aacute; desenhado para traduzir entre l&iacute;nguas relacionadas. O cons&oacute;rcio Opentrad foi liderado por <a href="http://www.eleka.net/">Eleka  Ingeniaritza Linguistikoa</a>.</p>

<p>O projecto Opentrad ("Tradu&ccedil;&atilde;o autom&aacute;tica de c&oacute;digo aberto para as l&iacute;nguas do Estado espanhol") foi financiado pelo <a href="http://www.min.es/">Minist&eacute;rio de Ind&uacute;stria, Turismo e Com&eacute;rcio</a> de Espanha atrav&eacute;s das ajudas PROFIT com c&oacute;digos FIT340101-2004-0003 e FIT340001-2005-0002.</p>

<p>Mais recentemente, Apertium recebeu tamb&eacute;m financiamento da <a href="http://www10.gencat.net/dursi/AppJava/home.jsp?area=3&=2">Secretaria de Telecomunica&ccedil;&otilde;es e Sociedade da Informa&ccedil;&atilde;o</a> da Generalitat de Catalunha para desenvolver novos pares de l&iacute;nguas e um motor melhorado (Apertium 2.0) para incluir pares mais dif&iacute;ceis como por exemplo ingl&ecirc;s–catal&atilde;o e de novo do <a href="http://www.min.es/">Minist&eacute;rio de Ind&uacute;stria, Turismo e Com&eacute;rcio</a> atrav&eacute;s da ajuda <a href="http://www.mityc.es/profit/">PROFIT</a> n&uacute;mero FIT350401-2006-05 (EurOpenTrad).</p>

<p>Partes de Apertium foram tamb&eacute;m financiadas pela Universitat d'Alacant.</p>

</div>
