Repository: sushain97/apertium-monorepo-svn-82937
Catalog: trunk/apertium-simpledix/i18n/simpledix_*.po
Languages: es

source: Really delete all?
es: ¿Desea borrar todos?

source: Configuration files:
es: Ficheros de configuración

source: Generate directions:
es: Direcciones de traducción:

source: Filter by lexical category:
es: Filtrar por categoría léxica:

source: Word will be inserted
es: La palabra se insertará

source: Insert text
es: Esta palabra se insertará en el diccionario.

source: Word is already inserted
es: Palabra ya insertada

source: Already text
es: Esta palabra ya se encuentra en el diccionario.

source: Word or paradigm is undefined
es: Palabra o paradigma no definidos

source: Error text
es: Esta palabra está mal definida. Por favor, escribe la palabra y selecciona el paradigma.

source: Regenerate insertions
es: Regenerar inserciones

source: Warning text
es: Esta palabra cambió desde la ultima vez que pulsaste el botón generar.

source: Existing translations:
es: Traducciones existentes:

source: Generate insertions
es: Generar inserciones

source: Insert into dix
es: Insertar en el dix

source: Clear form
es: Limpiar formulario

source: Show insert queries
es: Editar nodos

source: Explain show insert
es: Muestra los nodos que se insertarán en el diccionario de apertium para comprobar si son correctos, o modificarlos.

source: Close session
es: Cerrar la sesión

source: Explain close insert
es: Cierra la sesión, eliminando todos los datos del usuario. Exporta y descarga los diccionarios antes si quieres guardar tu trabajo.

source: ¿Export dictionaries?
es: ¿Exportar diccionarios?

source: Error while listing paradigms
es: Error: no se pudo listar los paradigmas de la palagra

source: Error while flexing a word
es: Error: no se pudo flexionar la palabra

source: Error while checking if a word exists in the dix
es: Error: no se pudo comprobar si la palabra está insertada

source: Error: undefined word
es: Error: palabra sin definir

source: Error: undefined paradigm
es: Error: paradigma de palabra sin definir

source: Unavailable pair
es: Par no instalado

source: Translation exists
es: La traducción ya existe

source: Error while checking if the translation exists
es: Error: no se pudo comprobar si la traducción existe

source: Generating...
es: Generando...

source: Successfully inserted
es: Correctamente insertado

source: Error while inserting
es: Error: no se pudo insertar

source: Error while getting the installed pairs
es: Error: no se pudieron obtener los pares instalados

source: Installed pair
es: Par instalado

source: Exporting...
es: Exportando...

source: Error while exporting dictionaries
es: Error: no se pudieron exportar los diccionarios

source: All your work will be lost. Make sure you have the dictionaries downloaded
es: Todo tu trabajo se perderá. Asegúrate de tener correctamente descargados los diccionarios

source: Dictionaries exported. You may now download them
es: Diccionarios correctamente exportados.

source: Hide insert queries
es: Dejar de editar nodos

source: Generate the insertions before inserting
es: Generar antes de insertar

source: all
es: todas las categorías léxicas

source: acronym
es: acrónimo

source: pre-determiner
es: pre-determinante

source: det
es: Determinante

source: location
es: lugar

source: anthroponym
es: antropónimo

source: other
es: otros

source: cognomen
es: apellidos

source: atonic
es: atónico

source: enclitic
es: enclítico

source: proclitic
es: proclítico

source: tonic
es: tónico

source: n
es: Nombre

source: pn
es: Pronombre

source: adj
es: Adjetivo

source: adv
es: Adverbio

source: preadverb
es: preadverbio

source: preposition
es: preposición

source: prn
es: Pronombre

source: relative
es: relativo

source: interrogative
es: interrogativo

source: determiner
es: determinante

source: demonstrative
es: demostrativo

source: definite
es: definido

source: coordinating conjuction
es: conjunción coordinante

source: subordinating conjuction
es: conjunción subordinante

source: adverbial conjuction
es: conjunción adverbial

source: vblex
es: Verbo

source: modal_verb
es: verbo modal

source: quantifier
es: cuantificador

source: num
es: Numeral

source: pronominal
es: pronombre

source: interjection
es: interjección

source: separable verb
es: verbo separable

source: comparative
es: comparativo

source: auxiliary verb
es: verbo auxiliar

source: currency
es: moneda

source: Show only installed pairs
es: Mostrar solo pares instalados

source: From disk
es: Desde disco

source: From url
es: Desde url

source: Dictionary:
es: Diccionario:

source: Configuration file (Optional):
es: Sobreescribir fichero de configuración por defecto:

source: Configuration file:
es: Fichero de configuración (necesario):

source: Clear
es: Limpiar formulario

source: Bilingual:
es: Diccionario bilingüe:

source: Upload
es: Subir

source: Delete all?
es: ¿Borrar todos?

source: Extension should be in
es: La extensión debe ser

source: Missing files
es: Faltan ficheros

source: Missing configuration
es: Error: falta un fichero de configuración

source: Error while checking if a conf file exists
es: Error: no se pudo comprobar si un fichero de configuración existe

source: Both languages should be defined
es: Debes definir ambas lenguas.

source: Same language in both dictionaries
es: Ambos diccionarios son de la misma lengua
