<div id="main">
    
    <h2>&iquest;Qu&eacute; es Apertium?</h2>
    
    <p>Apertium es una <b>plataforma de traducci&oacute;n autom&aacute;tica
    libre/de c&oacute;digo fuente abierto</b>, inicialmente pensada para pares de lenguas emparentadas, pero que ha sido recientemente ampliada para poder tratar con pares de lenguas m&aacute;s divergentes (como por ejemplo ingl&eacute;s–catal&aacute;n). La plataforma proporciona</p>
    
    <ol class="abc">
        <li>un ingenio de traducci&oacute;n independiente de las lenguas</li>
        <li>herramientas para gestionar los datos ling&uuml;&iacute;sticos necesarios para construir un sistema de traducci&oacute;n autom&aacute;tica para un par de lenguas dado</li>
        <li>datos ling&uuml;&iacute;sticos para un n&uacute;mero creciente de pares de lenguas.</li>
    </ol>
    
    <p>Apertium usa un motor de traducci&oacute;n de transferencia superficial que procesa el texto de entrada en etapas, como en una cadena de montaje: desformateo, an&aacute;lisis morfol&oacute;gico, desambiguaci&oacute;n categorial, transferencia estructural superficial, transferencia l&eacute;xica, generaci&oacute;n morfol&oacute;gica y reformateo.</p>
    
    <p>Apertium usa transductores de estados finitos para las operaciones de procesamiento l&eacute;xico (an&aacute;lisis y generaci&oacute;n morfol&oacute;gica, transferencia l&eacute;xica), modelos ocultos de Markov para la desambiguaci&oacute;n categorial y chunking multietapa basado en estados finitos para la transferencia superficial.</p>
    
    <p>El dise&ntilde;o inicial est&aacute; basado en el de sistemas que ya hab&iacute;a desarrollado el grupo Transducens de la Universitat d'Alacant, como <b><a href="http://www.internostrum.com/welcome.php" target="_blank">interNOSTRUM</a></b> (espa&ntilde;ol–catal&aacute;n), y <b><a href="http://traductor.universia.net" target="_blank">Traductor Universia</a></b> (espa&ntilde;ol–portugu&eacute;s).</p>
    
    <p>Es possible usar Apertium para construir sistemas de traducci&oacute;n autom&aacute;tica para una gran variedad de pares de lenguas; para ello, Apertium usa formatos sencillos basados en <acronym title="eXtensible Markup Language">XML</acronym> para codificar los datos ling&uuml;&iacute;sticos necesarios (hechos a mano o por conversi&oacute;n de datos existentes) que se compilan, con las herramientas que se proveen, en formatos de gran velocidad usados por el motor.</p>
    
<h2>&iquest;Qui&eacute;n desarrolla Apertium?</h2>

<p>La plataforma Apertium la est&aacute; desarrollando el grupo de investigaci&oacute;n <a href="http://transducens.dlsi.ua.es">Transducens</a> del <a href="http://www.dlsi.ua.es">Departament de Llenguatges i Sistemes Inform&agrave;tics</a> de la <a href="http://www.ua.es">Universitat d'Alacant</a>
en colaboraci&oacute;n con <a href="http://www.prompsit.com">Prompsit
Language Engineering</a>.</p>

<p>Muchos grupos est&aacute;n desarrollando datos ling&uuml;&iacute;sticos para Apertium.</p>

<p>Transducens y Prompsit est&aacute;n desarrollando los pares</p>

<ul>
	<li>espa&ntilde;ol–catal&aacute;n</li>
	<li>espa&ntilde;ol–portugu&eacute;s</li>
	<li>catal&aacute;n–franc&eacute;s</li>
	<li>occitano–catal&aacute;n</li>
	<li>ingl&eacute;s–catal&aacute;n</li>
</ul>

<p>el <a href="http://webs.uvigo.es/sli/">Seminario de Ling&uuml;&iacute;stica Inform&agrave;tica</a> de la <a href="http://www.uvigo.es/indice/index.gl.htm">Universidade de Vigo</a>, el par</p>

<ul>
	<li>espa&ntilde;ol-gallego</li>
</ul>

<p>y el <a href="http://www.iula.upf.edu/">Institut Universitari de Ling&uuml;&iacute;stica Aplicada</a> de la <a href="http://www.upf.edu/">Universitat Pompeu Fabra</a>, los pares</p>
<ul>
	<li>occitano–catal&aacute;n</li>
	<li>ingl&eacute;s–catal&aacute;n</li>
	<li>franc&eacute;s–catal&aacute;n</li>
</ul>

<p><a href="http://sourceforge.net/project/memberlist.php?group_id=143781">Muchos otros desarrolladores</a> est&aacute;n generando tambi&eacute;n <a href="http://ilazki.thinkgeek.co.uk/apertium/graph.svg">nuevos pares</a>. Puede <a href="http://apertium.svn.sourceforge.net/viewvc/apertium/">visitar el dep&oacute;sito <acronym title="Subversion">SVN</acronym></a> para ver una instant&aacute;nea del desarrollo actual. Tambi&eacute;n puede observarse a&uacute;n algo de actividad en <a href="http://apertium.cvs.sourceforge.net/apertium/">el antiguo dep&oacute;sito <acronym title="Concurrent Versions System">CVS</acronym></a>.</p>

<!--
<p>Apertium welcomes new developers: if you think you can improve the engine or the tools, or develop linguistic data for us, do not hesitate to <a href="?id=contact">contact us</a>.
-->
</p>

<h2>Financiaci&oacute;n</h2>

<p>Apertium &eacute;s uno de los dos ingenios de traducci&oacute;n autom&aacute;tica de c&oacute;digo abierto que empezaron a ser desarrollados dentro del proyecto <a href="http://www.opentrad.org/">OpenTrad</a> (2004–2005); Apertium est&aacute; dise&ntilde;ado para traducir entre lenguas relacionadas (v&eacute;ase la Documentaci&oacute;n m&aacute;s arriba). El consorcio Opentrad fue liderado por <a href="http://www.eleka.net/">Eleka Ingeniaritza Linguistikoa</a>.</p>

<p>El proyecto Opentrad ("Traducci&oacute;n autom&aacute;tica de c&oacute;digo abierto para las lenguas del Estado espa&ntilde;ol") fue financiado por el <a href="http://www.min.es/">Ministerio de Industria, Turismo y Comercio</a> de Espa&ntilde;a a trav&eacute;s de las ayudas PROFIT con c&oacute;digos FIT340101-2004-0003 y FIT340001-2005-0002.</p>

<p>M&aacute;s recientmente, Apertium ha recibido tambi&eacute;n financiaci&oacute;n de la <a href="http://www10.gencat.net/dursi/AppJava/home.jsp?area=3&=2">Secretaria de Telecomunicacions i Societat de la Informaci&oacute;</a> de Generalitat de Catalunya para desarrollar nuevos pares de lenguas y un ingenio mejorado (Apertium 2.0) para incluir pares m&aacute;s difíciles como el ingl&eacute;s–catal&aacute;n y nuevamente del <a href="http://www.min.es/">Ministerio de Industria, Turismo y Comercio</a> a trav&eacute;s de la ayuda <a href="http://www.mityc.es/profit/"><acronym title="Programa de Fomento de la Investigaci&oacute;n T&eacute;cnica">PROFIT</acronym></a> n&uacute;mero FIT350401-2006-05 (EurOpenTrad).</p>

<p>El proyecto Trautorom ("Traducción automática rumano-español", paquete 
   <code>apertium-es-ro</code>) 
   ha sido financiado por la Universidad de Alicante a través del 
   Departamento de Lenguajes y Sistemas Informáticos y del Vicerrectorado
   de Extensión Universitaria, y por el 
	<a href="http://www.mae.ro">Ministerio d'Asuntos Exteriores</a> de Rumanía.
	</p>

<p>Algunas partes de Apertium tambi&eacute;n han sido financiadas por la Universitat d'Alacant</p>

</div>
