<div id="main">

<h2>Que &eacute; Apertium?</h2>

<p>Apertium &eacute; unha <b>plataforma de traduci&oacute;n autom&aacute;tica
libre/de c&oacute;digo fonte aberto</b>, inicialmente pensada para pares de linguas emparentadas, pero que foi recentemente expandida para poder tratar pares de linguas m&aacute;is diverxentes (por exemplo ingl&eacute;s–catal&aacute;n). A plataforma proporciona (a) un motor de traduci&oacute;n independente das linguas, (b) ferramentas para xestionar os datos ling&uuml;&iacute;sticos necesarios para constru&iacute;r un sistema de traduci&oacute;n autom&aacute;tica para un par de linguas dado e (c) datos ling&uuml;&iacute;sticos para un n&uacute;mero crecente de pares de linguas.</p>

<p>Apertium usa un motor de traduci&oacute;n de transferencia superficial que procesa o texto de entrada en etapas, como nunha cadea de montaxe: desformateo, an&aacute;lise morfol&oacute;xica, desambiguaci&oacute;n categorial, transferencia estructural superficial, transferencia l&eacute;xica, xeraci&oacute;n morfol&oacute;xica e reformateo.</p>

<p>Apertium usa transductores de estados finitos para as operaci&oacute;ns de procesamento l&eacute;xico (an&aacute;lises e xeraci&oacute;n morfol&oacute;xica, transferencia l&eacute;xica), modelos ocultos de Markov para a desambiguaci&oacute;n categorial e chunking multietapa baseado en estados finitos para a transferencia superficial.</p>

<p>O dese&ntilde;o inicial est&aacute; baseado no de sistemas que xa desenvolvera o grupo Transducens da Universitat d'Alacant, por exemplo <b><a href="http://www.internostrum.com/welcome.php" target="_blank">interNOSTRUM</a></b> (espa&ntilde;ol–catal&aacute;n), e <b><a href="http://traductor.universia.net" target="_blank">Traductor Universia</a></b> (espa&ntilde;ol–portugu&eacute;s).</p>

<p>&Eacute; pos&iacute;bel usar Apertium para constru&iacute;r sistemas de traduci&oacute;n autom&aacute;tica para unha gran variedade de pares de linguas; para iso, Apertium usa formatos sinxelos baseados en XML para codificar os datos ling&uuml;&iacute;sticos necesarios (creados a man ou por conversi&oacute;n de datos existentes) que se compilan, coas ferramentas que se prov&eacute;n, aos formatos de gran velocidade usados polo motor.</p>

<h2>Quen desenvolve Apertium?</h2>

<p>A arquitectura Apertium esta a ser desenvolvida polo grupo de investigaci&oacute;n <a href="http://transducens.dlsi.ua.es">Transducens</a> do <a href="http://www.dlsi.ua.es">Departamento de Linguaxes e Sistemas Inform&aacute;ticos</a> da <a href="http://www.ua.es">Universitat d'Alacant</a> en colaboraci&oacute;n com <a href="http://www.prompsit.com">Prompsit
Language Engineering</a>.</p>

<p>Moitos grupos est&aacute;n desenvolvendo datos ling&uuml;&iacute;sticos para Apertium.</p>

<p>Transducens e Prompsit est&aacute;n desenvolvendo os pares</p>

<ul>
	<li>espa&ntilde;ol–catal&aacute;n</li>
	<li>espa&ntilde;ol–portugu&eacute;s</li>
	<li>catal&aacute;n–franc&eacute;s</li>
	<li>occitano–catal&aacute;n e</li>
	<li>ingl&eacute;s–catal&aacute;n</li>
</ul>

<p>o <a href="http://webs.uvigo.es/sli/">Seminario de Ling&uuml;&iacute;stica Inform&aacute;tica</a> da <a href="http://www.uvigo.es/indice/index.gl.htm">Universidade de Vigo</a> , o par</p>
<ul>
	<li>espa&ntilde;ol–galego</li>
</ul>
<p>e o <a href="http://www.iula.upf.edu/">Instituto Universitario de Ling&uuml;&iacute;stica Aplicada</a> da <a href="http://www.upf.edu/">Universitat Pompeu Fabra</a>, os pares:
<ul>
	<li>ingl&eacute;s–catal&aacute;n e</li>
	<li>catal&aacute;n–franc&eacute;s</li>
</ul>
 
<p><a href="http://sourceforge.net/project/memberlist.php?group_id=143781">Outros moitos desenvolvedores</a> est&aacute;n tam&eacute;n xerando <a href="http://ilazki.thinkgeek.co.uk/apertium/graph.svg">novos pares</a>. Pode <a href="http://apertium.svn.sourceforge.net/viewvc/apertium/">visitar o dep&oacute;sito SVN</a> para ver unha instant&aacute;nea do desenvolvemento actual. Tam&eacute;n se pode ver a&iacute;nda algo de actividade <a href="http://apertium.cvs.sourceforge.net/apertium/">no vello dep&oacute;sito CVS</a>.</p>

<!--
<p>Apertium welcomes new developers: if you think you can improve the engine or the tools, or develop linguistic data for us, do not hesitate to <a href="?id=contact">contact us</a>.
</p>
-->

<h2>Financiamento</h2>

<p>Apertium &eacute; un dos dous motores de traduci&oacute;n autom&aacute;tica de c&oacute;digo aberto que empezaron a ser desenvolvidos dentro do proxecto <a href="http://www.opentrad.org/">OpenTrad</a> (2004–2005); Apertium est&aacute; dese&ntilde;ado para traducir entre linguas relacionadas (ver Documentaci&oacute;n m&aacute;is arriba). O consorcio Opentrad foi liderado por <a href="http://www.eleka.net/">Eleka Ingeniaritza Linguistikoa</a>.</p>

<p>O proxecto Opentrad ("Traduci&oacute;n autom&aacute;tica de c&oacute;digo aberto para as linguas do Estado espa&ntilde;ol") foi financiado polo <a href="http://www.min.es/">Ministerio de Industria, Turismo e Comercio</a> de Espa&ntilde;a a trav&eacute;s das axudas PROFIT con c&oacute;digos FIT340101-2004-0003 e FIT340001-2005-0002.</p>

<p>M&aacute;is recentemente, Apertium recibiu tam&eacute;n financiamento da <a href="http://www10.gencat.net/dursi/AppJava/home.jsp?area=3&=2">Secretar&iacute;a de Telecomunicaci&oacute;ns e Sociedade da Informaci&oacute;n</a> da Generalitat de Catalunya para desenvolver novos pares de linguas e un motor mellorado (Apertium 2.0) para inclu&iacute;r pares m&aacute;is dif&iacute;ciles por exemplo ingl&eacute;s–catal&aacute;n e de novo do <a href="http://www.min.es/">Ministerio de Industria, Turismo e Comercio</a> a trav&eacute;s da axuda <a href="http://www.mityc.es/profit/">PROFIT</a> n&uacute;mero FIT350401-2006-05 (EurOpenTrad).</p>

<p>Partes de Apertium foron tam&eacute;n financiadas pola Universitat d'Alacant.</p> 

</div>
