<div id="main">

<h2>Qu'est-ce que c'est Apertium ?</h2>

<p>Apertium est une <b>plate-forme de traduction automatique libre/de code
source ouvert</b>. Initialement con&ccedil;ue pour des paires de langues apparant&eacute;es, Apertium a été récemment développé pour d'autres paires de langues plus &eacute;loign&eacute;es (comme l'anglais–catalan). La plate-forme fournit</p>

<ol class="abc">
	<li>un moteur de traduction automatique ind&eacute;pendant d'une langue quelconque</li>
	<li> des outils pour g&eacute;rer les donn&eacute;es linguistiques n&eacute;cessaires pour construire un syst&egrave;me de traduction automatique pour une paire donn&eacute;e</li> 
	<li>des donn&eacute;es linguistiques pour un nombre toujours croissant de paires de langues.</li>
</ol>

<p>Apertium utilise un moteur de traduction automatique par transfert superficiel qui traite en plusieurs &eacute;tapes le texte d'entr&eacute;e, comme dans une cha&icirc;ne de montage : d&eacute;formatage, analyse morphologique, transfert superficiel des structures, transfert lexical, g&eacute;n&eacute;ration morphologique, et reformatage.</p>

<p>Apertium utilise un transducteur d'&eacute;tat fini pour toutes les op&eacute;rations du traitement lexical (analyse morphologique et g&eacute;n&eacute;ration morphologique, transfert lexical), des mod&egrave;les de Markov cach&eacute;s pour le balisage des cat&eacute;gories grammaticales, une d&eacute;composition en plusieurs &eacute;tapes &agrave; des &eacute;tats finis pour le transfert des structures.</p>

<p>Les premi&egrave;res versions &eacute;taient en grande partie fond&eacute;es sur des syst&egrave;mes d&eacute;velopp&eacute;s par le groupe Transducens de la Universit&eacute; d'Alacant, comme par exemple <b><a href="http://www.internostrum.com/welcome.php" target="_blank">interNOSTRUM</a></b> (espagnol-catalan, et) <b><a href="http://traductor.universia.net" target="_blank">Traductor Universia</a></b> (espagnol-portugais).</p>

<p>Il est possible d'utiliser Apertium pour cr&eacute;er des syst&egrave;mes de traduction automatique pour d'autres paires de langues. Pour ce faire, Apertium utilise des simples fichiers au format XML pour encoder les donn&eacute;es linguistiques n&eacute;cessaires (cela peut se faire manuellement ou en convertissant les donn&eacute;es d&eacute;j&agrave; existantes), qui sont compil&eacute;es gr&acirc;ce aux outils disponibles pour obtenir des formats tr&egrave;s rapides utilis&eacute;es par le moteur d'Apertium.</p>

<h2>Qui d&eacute;veloppe Apertium?</h2>

<p>L'architecture Apertium est d&eacute;velopp&eacute;e par le groupe de recherche <a href="http://transducens.dlsi.ua.es">Transducens</a> du <a href="http://www.dlsi.ua.es">Departament de Llenguatges i Sistemes Inform&agrave;tics</a> de l' <a href="http://www.ua.es">Universitat d'Alacant</a> en partenariat avec <a href="http://www.prompsit.com">Prompsit
Language Engineering</a>.</p>

<p>Les donn&eacute;es linguistiques pour Apertium sont d&eacute;velopp&eacute;es par:</p>

<p>Transducens et Prompsit</p>
<ul>
	<li>espagnol&ndash;catalan</li>
	<li>espagnol&ndash;portugais</li>
	<li>catalan&ndash;fran&ccedil;ais</li>
	<li>occitan&ndash;catalan</li>
	<li>anglais&ndash;catalan</li>
</ul>

<p>le <a href="http://webs.uvigo.es/sli/">Seminario de Ling&uuml;&iacute;stica Inform&aacute;tica</a> de la <a href="http://www.uvigo.es/indice/index.gl.htm">Universidade de Vigo</a>:</p>
<ul>
	<li>espagnol&ndash;Galician</li>
</ul>

<p>et de l' <a href="http://www.iula.upf.edu/">Institut Universitari de Ling&uuml;&iacute;stica Aplicada</a> de l' <a href="http://www.upf.edu/">Universitat Pompeu Fabra</a> &agrave; Barcelone</p>
<ul>
	<li>occitan&ndash;catalan</li>
	<li>anglais&ndash;catalan</li>
	<li>fran&ccedil;ais&ndash;catalan</li>
</ul>

<p><a href="http://sourceforge.net/project/memberlist.php?group_id=143781">D'autres nombreux d&eacute;veloppeurs</a> ont cr&eacute;é des <a href="http://ilazki.thinkgeek.co.uk/apertium/graph.svg">nouvelles paires</a>. Vous pouvez <a href="http://apertium.svn.sourceforge.net/viewvc/apertium/">visiter le d&eacute;p&ocirc;t SVN</a> pour voir la derni&egrave;re version en d&eacute;veloppement. Vous pouvez aussi voir certaines modifications sur <a href="http://apertium.cvs.sourceforge.net/apertium/">l'ancien d&eacute;p&ocirc;t CVS</a>.</p>

<p>Apertium souhaite toujours accueillir des nouveaux d&eacute;veloppeurs dans son &eacute;quipe. Si vous pensez que vous pouvez am&eacute;liorer le moteur, les outils, les donn&eacute;es linguistiques, n'h&eacute;sitez pas &agrave; nous <a href="?id=contact">contacter </a> (voir ci-dessous)</p>

<h2>Financement</h2>

<p>Apertium est l'un des deux moteurs de traduction automatique d&eacute;velopp&eacute; au sein du projet <a href="http://www.opentrad.org/">OpenTrad</a> (2004–2005). Apertium est con&ccedil;u pour d&eacute;velopper des paires de langues apparent&eacute;es (consultez la <a href="?id=documentation"/>documentation</a>). Le consortium OpenTRad &eacute;tait men&eacute; par <a href="http://www.eleka.net/">Eleka Ingeniaritza Linguistikoa</a>.</p>

<p>Le projet Opentrad ("Logiciel libre de traduction automatique pour les langues de l'&Eacute;tat espagnol") a &eacute;t&eacute; financ&eacute; par le <a href="http://www.min.es/">Minist&egrave;re de l'Industrie, le Tourisme et le Commerce</a> de l'Espagne par le biais de bourses PROFIT ayant pour r&eacute;f&eacute;rence FIT340101-2004-0003 et FIT340001-2005-0002.</p>

<p>Plus r&eacute;cemment, Apertium a aussi re&ccedil;u un financement de la Generalitat de Catalogne (le gouvernement de la communaut&eacute; autonome de Catalagone, en Espagne) pour d&eacute;velopper des nouvelles paires de langues et une nouvelle architecture(Apertium 2.0) pour traiter des paires plus difficiles comme l'anglais–catalan et &agrave; nouveau du <a href="http://www.min.es/">Minist&egrave;re de l'Industrie, le Tourisme et le Commerce</a> d'Espagne par le biais d'une bourse <a href="http://www.mityc.es/profit/">PROFIT</a> ayant pour r&eacute;ference FIT350401-2006-05 (EurOpenTrad).</p>

<p>Certaines parties d'Apertium ont &eacute;t&eacute; financ&eacute;es par l'Universitat d'Alacant.</p>

</div>
