<div id="main">
    <h2>Hva er Apertium?</h2>
    
    <p>Apertium er en <b>maskinoversettelsesplattform med fri og åpen
    kildekode</b>, opprinnelig rettet mot nært beslektede spr&aring;kpar, men senere utvidet til &aring; behandle mer ulike spr&aring;kpar (f.eks. engelsk–katalansk). Plattformen tilbyr</p>
    
    <ol class="abc">
        <li>en spr&aring;kuavhengig maskinoversettelsesmotor,</li>
        <li>verkt&oslash;y for &aring; behandle dem lingvistiske ressursene som kreves for &aring; bygge et maskinoversettelsessystem for et visst spr&aring;kpar, og</li>
        <li>lingvistiske ressurser for et &oslash;kende antall spr&aring;kpar.</li>
    </ol>
    
    <p>Apertium bruker en <i>shallow-transfer</i> maskinoversettelsesmotor. Denne behandler innkommande tekst stegvis, som p&aring; et samleb&aring;nd: avformatering, morfologisk analyse, ordklassedisambiguering (entydiggjøring), overflatisk strukturoverf&oslash;ring, leksikalsk overf&oslash;ring, morfologisk produksjon og gjenformatering.</p>
    <p>Apertium bruker endelige tilstandsmaskiner i alle leksikalske prosesser (morfologisk analyse og produksjon, leksikalsk overf&oslash;ring), skjulte Markov-modeller (m.a.) i ordklassedisambiguering, og overflatisk syntaktisk analyse (<i>chunking</i>) basert p&aring; endelige tilstandsmaskinar for flerstegs strukturell overf&oslash;ring.</p>
    <p>Den opprinnelige utformingen var hovedsakelig bygget p&aring; system som allerede var utviklet av Transducens-gruppen ved Universitat d'Alacant, f.eks. <b><a href="http://www.internostrum.com/welcome.php">interNOSTRUM</a></b> (spansk–katalansk), og <b><a href="http://traductor.universia.net">Traductor Universia</a></b> (spansk–portugisisk).</p>
    <p>Det er mulig &aring; bygge maskinoversettelsessystem for en
    mengde med ulike spr&aring;kpar med Apertium; til dette benytter
    Apertium enkle, standardiserte XML-format for &aring; kode den
    lingvistiske informasjonen (enten for hånd eller ved &aring;
    konvertere eksisterende data). Med hjelp av verkt&oslash;yene i
    systemet blir informasjonen kompilert til de svært effektive formatene som oversettelsesmotoren leser.</p>
    
    <!--
<div class="small box"><strong>Last ned kildekoden til Apertium:</strong><br/><br/>
<div id="downloadbar" style="margin: 0 0 0 2em; width: 16em">
         <a href="http://sf.net/projects/apertium/">Last ned Apertium!</a>
</div>
</div>
-->
    
    <h2>Hvem er det som utvikler Apertium?</h2>
    <p>Apertium-arkitekturen utvikles av forskingsgruppen <a href="http://transducens.dlsi.ua.es">Transducens</a>, en del av <a href="http://www.dlsi.ua.es">Departament de Llenguatges i Sistemes Inform&agrave;tics</a> ved <a href="http://www.ua.es">Universitat d'Alacant</a> i samarbeid med <a href="http://www.prompsit.com">Prompsit
        Language Engineering</a>.
    </p>
    <p>Lingvistiske ressurser for Apertium utviklet av Transducens og Prompsit:</p>
    <ul>
        <li>Spansk–Katalansk</li>
        <li>Spansk–Portugisisk</li>
        <li>Katalansk–Fransk</li>
        <li>Oksitansk–Katalansk</li>
        <li>Engelsk–Katalansk</li>
    </ul>
    <a href="http://webs.uvigo.es/sli/">Seminario dere Ling&uuml;&iacute;stica Inform&aacute;tica</a> ved <a href="http://www.uvigo.es/indice/index.gl.htm">Universidade dere Vigo</a>:
    <ul>
        <li>Spansk–Galisisk</li>
    </ul>
    og <a href="http://www.iula.upf.edu/">Institut Universitari dere Ling&uuml;&iacute;stica Aplicada</a> ved <a href="http://www.upf.edu/">Universitat Pompeu Fabra</a> i Barcelona:
    <ul>
        <li>Oksitansk–Katalansk</li>
        <li>Engelsk–Katalansk</li>
        <li>Fransk–Katalansk</li>
    </ul>
    
    <p><a href="http://sourceforge.net/project/memberlist.php?group_id=143781">Mange andre utviklere </a> er også med p&aring; &aring; skape <a href="http://ilazki.thinkgeek.co.uk/apertium/graph.svg">nye spr&aring;kpar</a>. Du kan <a href="http://apertium.svn.sourceforge.net/viewvc/apertium/">se i <acronym title="Subversion">SVN</acronym>-kodelageret</a> om du lurer p&aring; hva som utvikles  nettop n&aring;.
    </p>
    <p>Apertium byr nye utviklere velkommen: om du har lyst til &aring; bedre p&aring; motoren eller verkt&oslash;yene, eller utvikle lingvistiske ressurser for prosjektet m&aring; du ikke n&oslash;le med &aring; <a href="?id=contact">ta kontakt</a>.
    </p>

    <h2>&Oslash;konomisk støtte</h2>
    
    <p>Apertium er &eacute;n av to maskinoversettelsesmotorar med åpen kildekode som fikk sin begynnelse innen <a href="http://www.opentrad.org/">OpenTrad</a>-prosjektet (2004–2005); Apertium er ment &aring; oversette mellom nært beslektede spr&aring;k. OpenTrad-samanslutninga ble styrt av <a href="http://www.eleka.net/">Eleka Ingeniaritza Linguistikoa</a>.
    </p>
    
    <p>OpenTrad-prosjektet (&laquo;Maskinoversettelse med åpen kildekode for spr&aring;kene i Spania&raquo;) ble st&oslash;ttet av det spanske <a href="http://www.min.es/">Departementet for industri, turisme og handel</a> gjennom PROFIT-bevilgningene FIT340101-2004-0003 og FIT340001-2005-0002.
    </p>
    
    <p>I det siste har Apertium ogs&aring; f&aring;tt støtte fra <a href="http://www10.gencat.net/dursi/AppJava/home.jsp?area=3&=2">Sekretariatet for telekommunikasjon og informasjonssamfunnet</a> i Generalitat de Catalunya (regjeringen for den autonome regionen Catalonia i Spania) for &aring; utvikle nye spr&aring;kpar og for en bedret arkitektur (Apertium 2.0) som lar oss ta med mer vanskelige spr&aring;kpar, f.eks. engelsk–katalansk. I tillegg har Apertium f&aring;tt støtte fra <a href="http://www.min.es/">Departementet for industri, turisme og handel</a> i Spania gjennom <a href="http://www.mityc.es/profit/">PROFIT</a>-bevilgningene FIT350401-2006-05 (EurOpenTrad).
    </p>
    
    <p>Trautorom-prosjektet (&laquo;Rumensk–Spansk maskinoversettelse&raquo;, pakken <code>apertium-es-ro</code>) 
        ble st&oslash;ttet av: Instituttet for spr&aring;k og informasjonssystem og Viserektoratet for utenomfaglege aktiviteter (Vicerrectorado de Extensi&oacute;n Universitaria) ved Universitat d'Alacant, i tillegg til det rumenske
        <a href="http://www.mae.ro">Utenriksdepartementet</a>.
    </p>
    
    
    <p>Deler av Apertium har også mottatt støtte fra <a href="http://www.ua.es">Universitat d'Alacant</a>.</p>
    
</div>
